In [2]:
import pandas as pd

### Criando uma Series

In [3]:
# Criando uma lista:
data = [1, 2, 3, 4, 5]

In [4]:
# Criando uma series: Lado esquerdo indice e lado direito valor
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# Alterando o indice com o listcomprehsion:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [6]:
# passando a variavel index como indice da Series: ou seja criando rotulos para as linhas:
s = pd.Series(data, index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

#### Outra forma de fazer é passando os valores por um dicionário:

In [7]:
data = {'Linha_' + str(i) : i + 1 for i in range(5)}
data

{'Linha_0': 1, 'Linha_1': 2, 'Linha_2': 3, 'Linha_3': 4, 'Linha_4': 5}

In [8]:
# Criando um Series:
s = pd.Series(data)
s

Linha_0    1
Linha_1    2
Linha_2    3
Linha_3    4
Linha_4    5
dtype: int64

#### Operações matmáticas nas linhas das Series:

In [9]:
somando_linhas = s + 2
somando_linhas

Linha_0    3
Linha_1    4
Linha_2    5
Linha_3    6
Linha_4    7
dtype: int64

#### Somando duas Colunas Series:

In [10]:
somando_series = s + somando_linhas
somando_series

Linha_0     4
Linha_1     6
Linha_2     8
Linha_3    10
Linha_4    12
dtype: int64

## DataFrame

In [11]:
# Criando listas dentro de listas:
data = [[1, 2, 3], 
        [4, 5, 6],
        [7, 8, 9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [12]:
# Criando um DataFrame simples, sem rotulos nas linhas e colunas:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [13]:
# Criando rotulo para as linhas:
index = ['Linha' + str(i) for i in range(len(data))]
index

['Linha0', 'Linha1', 'Linha2']

In [14]:
df1 = pd.DataFrame(data, index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [15]:
# Criando os rotulos das colunas:
columns = ['Coluna' + str(i) for i in range(len(data))]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [16]:
# Passando os parametros data, index, columns
df1 = pd.DataFrame(data, index, columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

#### Outro exemplo: Fazendo a mesma coisa porém com dicionários

In [17]:
data ={'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [18]:
data

{'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [19]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

#### Outro exemplo: Fazendo a mesma coisa porém com tuplas:

In [20]:
data = [(1, 2, 3), 
        (4, 5, 6),
        (7, 8, 9)]
data

[(1, 2, 3), (4, 5, 6), (7, 8, 9)]

In [21]:
df3 = pd.DataFrame(data, index, columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

#### Mudando os valores do DataFrame:

In [22]:
df1[df1 > 0] = 'A'
df1

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [23]:
df2[df2 > 0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [24]:
df3[df3 > 0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

#### Concatenando DataFrames:

In [25]:
# Método concat() concatena os DataFrames e passo como parametro uma lista de DataFrames:
df4 = pd.concat([df1, df2, df3])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

In [26]:
# Concatenando DataFrames por linhas:
df4 = pd.concat([df1, df2, df3], axis=1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B       C       C       C
Linha1       A       A       A       B       B       B       C       C       C
Linha2       A       A       A       B       B       B       C       C       C

In [27]:
df4.Coluna0

       Coluna0 Coluna0 Coluna0
Linha0       A       B       C
Linha1       A       B       C
Linha2       A       B       C

In [28]:
df4.Coluna1

       Coluna1 Coluna1 Coluna1
Linha0       A       B       C
Linha1       A       B       C
Linha2       A       B       C

In [29]:
df4.Coluna2

       Coluna2 Coluna2 Coluna2
Linha0       A       B       C
Linha1       A       B       C
Linha2       A       B       C